hugo/public/lunescript/lnstags/index.html
<!DOCTYPE html>
<html lang="ja-jp">
<head><meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
<title>A. lnstags によるタグジャンプ (ソースコードタグシステム) - 公開技術情報</title>
<meta name="generator" content="Hugo 0.100.1" />
<link href="https://ifritjp.github.io/documentsindex.xml" rel="alternate" type="application/rss+xml">
<link rel="canonical" href="https://ifritjp.github.io/documents/lunescript/lnstags/">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/theme.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/chroma.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/custom.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/highlight_lns.css">
<meta property="og:title" content="A. lnstags によるタグジャンプ (ソースコードタグシステム)" />
<meta property="og:description" content="LuneScript は、タグジャンプ (ソースコードタグシステム)に対応している。 タグジャンプ (ソースコードタグシステム) とは タグジャンプは、ソースコードの以下" />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://ifritjp.github.io/documents/lunescript/lnstags/" /><meta property="article:section" content="LuneScript" />

<meta property="og:site_name" content="公開技術情報" />

<meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="A. lnstags によるタグジャンプ (ソースコードタグシステム)"/>
<meta name="twitter:description" content="LuneScript は、タグジャンプ (ソースコードタグシステム)に対応している。 タグジャンプ (ソースコードタグシステム) とは タグジャンプは、ソースコードの以下"/>
<meta itemprop="name" content="A. lnstags によるタグジャンプ (ソースコードタグシステム)">
<meta itemprop="description" content="LuneScript は、タグジャンプ (ソースコードタグシステム)に対応している。 タグジャンプ (ソースコードタグシステム) とは タグジャンプは、ソースコードの以下">

<meta itemprop="wordCount" content="2580">
<meta itemprop="keywords" content="" />
</head>
<body><div class="container"><header>
<h1>公開技術情報</h1>


[<a href="https://ifritjp.github.io/documents/en/">English</a>]

[<a href="https://ifritjp.github.io/documents/">Japanese</a>]

</header>
<div class="global-menu">
<nav>
<ul>
<li><a href="/documents/">Home</a></li>
<li><a href="https://ifritjp.github.io/blog2/public/">blog</a></li>
<li><a href="https://ifritjp.github.io/LuneScript-webFront/lnsc_web_frontend/for_fengari/">LuneScript on Web</a></li></ul>
</nav>
</div>
<div class="content-container">
<main><h1>A. lnstags によるタグジャンプ (ソースコードタグシステム)</h1>

<p>
LuneScript は、タグジャンプ (ソースコードタグシステム)に対応している。</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
タグジャンプ (ソースコードタグシステム) とは
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
タグジャンプは、ソースコードの以下の情報へのアクセスを提供する。</p>
<ul>
<li>シンボル(クラス、関数、変数 etc..)の <strong>定義位置</strong></li>
<li>シンボル(クラス、関数、変数 etc..)の <strong>参照位置</strong></li>
</ul>
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
例
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>
以下に例を示す。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
class Foo {
   pub fn func() {
   }
}
class Bar {
   pub fn func() {
   }
}
let foo = new Foo();
foo.func();
let bar = new Bar();
bar.func();</code></pre>
</div>
<p>
たとえば、上記のような mini.lns ファイルがあった場合、
Foo クラスの func メソッドの定義位置をリストするには、
次のコマンドを実行する。</p>
<div class="src src-txt">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-txt" data-lang="txt"><span class="line"><span class="cl">$ lnstags inq def @mini.Foo.func
</span></span><span class="line"><span class="cl">@mini.Foo.func      2 mini.lns            pub fn func() {</span></span></code></pre></div>
</div>
<p>
Bar クラスの func メソッドの参照位置をリストするには、
次のコマンドを実行する。</p>
<div class="src src-txt">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-txt" data-lang="txt"><span class="line"><span class="cl">$ lnstags inq ref @mini.Bar.func
</span></span><span class="line"><span class="cl">@mini.Bar.func     12 mini.lns         bar.func();</span></span></code></pre></div>
</div>
<p>
lnstags コマンドの使用方法についての詳細は後述する。</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
lnstags の特徴
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>
lnstags は一般的なタグジャンプの機能に加え、次の機能を提供する。</p>
<ul>
<li>
<p>変数の値を設定している箇所のリスト</p>
<ul>
<li>値をセットしているのか、参照しているのかを区別していて、
<strong>値をセットしている箇所だけ</strong> をリストできる。</li>
</ul>
</li>
<li>
<p>継承関係の考慮</p>
<ul>
<li>オーバーライドされているメソッドをコールする場合、
ポリモーフィズムによって実際にコールされるメソッドが異なる。</li>
<li>lnstags では、コールされる可能性のあるメソッドを全てリストする。</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
使い方
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>
lnstags は、次の URL で公開している。</p>
<p>
&lt;<a href="https://github.com/ifritJP/lnstags">https://github.com/ifritJP/lnstags</a>&gt;</p>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
ビルド方法
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>
次の 2 つのビルド方法があります。</p>
<ul>
<li>go install を利用する</li>
<li>リポジトリを close して make する</li>
</ul>
<p>通常は go install で問題ありません。  </p>
<div id="outline-container-headline-6" class="outline-4">
<h4 id="headline-6">
go install 
</h4>
<div id="outline-text-headline-6" class="outline-text-4">
<p>
以下を実行すると、 $GOPATH/bin に lnstags がインストールされます。</p>
<pre class="example">
go install -tags gopherlua github.com/ifritJP/lnstags@latest
</pre>
</div>
</div>
<div id="outline-container-headline-7" class="outline-4">
<h4 id="headline-7">
go でビルドする。
</h4>
<div id="outline-text-headline-7" class="outline-text-4">
<div class="src src-txt">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-txt" data-lang="txt"><span class="line"><span class="cl">$ git clone --depth 1 https://github.com/ifritJP/lnstags
</span></span><span class="line"><span class="cl">$ cd lnstags
</span></span><span class="line"><span class="cl">$ make build ONLY_GO=y</span></span></code></pre></div>
</div>
<p>
上記で lnstags/lnstags が生成されます。</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
ソースコードの解析
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>
ソースコードの解析は、
解析対象のソースコードのプロジェクトディレクトリ上で実行する。</p>
<div class="src src-txt">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-txt" data-lang="txt"><span class="line"><span class="cl">$ cd proj  // lune.js を置いてあるディレクトリに移動する
</span></span><span class="line"><span class="cl">$ lnstags init
</span></span><span class="line"><span class="cl">$ lnstags build test/main.lns</span></span></code></pre></div>
</div>
<p>
<strong>lnstags build は、次のどちらかで実行する必要がある。</strong></p>
<ul>
<li>プロジェクトの main となる .lns ファイルを指定する</li>
</ul>
<pre class="example">
$ lnstags build main.lns
</pre>
<ul>
<li><code class="verbatim">lnstags build @-</code> として指定し、stdin に .lns ファイルのパスを 1 行づつ指定する。</li>
</ul>
<pre class="example">
$ find . -iname &#39;*.lns&#39; | lnstags build @-
</pre>
<p>
lnstags は、指定された lns ファイルから import されているモジュールを
辿って全て解析する。</p>
<p>
これにより、多くの場合は main となる .lns ファイルを指定するだけで問題ない。</p>
<p>
後者を使うケースは、
1 つの lns ファイルから全てのモジュールを辿れないケースで利用する。</p>
<p>
<strong>なお現在の lnstags は、差分更新はサポートしていない。</strong></p>
<p>
このため、 build に <strong>@-</strong> を使用する場合、全ての .lns ファイルを指定する必要がある。</p>
<p>
ソースコードの解析結果は、 <strong>lnstags.sqlite3 ファイル</strong> に登録する。</p>
</div>
</div>
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
DB の更新
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<p>
<code class="verbatim">lctags build</code> による解析後にソースコードを変更すると、
DB に登録している情報と実際のソースコードの情報に不整合が生じる。</p>
<p>
DB を更新するには、 <strong>次のいずれか</strong> を実行する。</p>
<ul>
<li><code class="verbatim">lctags build</code> を再度実行する。</li>
<li><code class="verbatim">lctags update</code> を実行する。</li>
</ul>
<pre class="example">
$ lctags update
</pre>
<div id="outline-container-headline-10" class="outline-4">
<h4 id="headline-10">
lctags update
</h4>
<div id="outline-text-headline-10" class="outline-text-4">
<p>
<code class="verbatim">lctags update</code> は、
DB に登録されている lns のソースファルイリストを元に、
情報を更新する。</p>
<p>
<code class="verbatim">lctags build</code> と異なり、解析するソースファイルを指定する必要がない。</p>
<p>
<strong>解析対象の lns ファイルが増減した場合</strong> は、
<code class="verbatim">lctags update</code> ではなく、
<code class="verbatim">lctags build</code> を使用しなければならない。</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-11" class="outline-3">
<h3 id="headline-11">
問い合わせ
</h3>
<div id="outline-text-headline-11" class="outline-text-3">
<p>
<code class="verbatim">lnstags build</code> でソースコードを解析した後は、シンボルの情報を問い合わせる。</p>
<p>
問い合わせには、次のパターンがある。</p>
<ul>
<li>inq</li>
<li>inq-at</li>
<li>suffix</li>
</ul>
<div id="outline-container-headline-12" class="outline-4">
<h4 id="headline-12">
inq
</h4>
<div id="outline-text-headline-12" class="outline-text-4">
<p>
inq は、シンボル名を指定して問い合わせを行なう。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
class Foo {
   pub fn func() {
   }
}
class Bar {
   pub fn func() {
   }
}
let foo = new Foo();
foo.func();
let bar = new Bar();
bar.func();</code></pre>
</div>
<p>
たとえば、上記のような mini.lns ファイルがあった場合、
Foo クラスの func メソッドのシンボル名は次になる。</p>
<pre class="example">
@mini.Foo.func
</pre>
<p>
ここで、 @mini はモジュール名を示し、 mini は mini.lns を指す。
例えば abc/def/ghi.lns の場合、モジュール名は <strong>@abc.@def.@ghi</strong> となる。
<code class="verbatim">Foo.func</code> は、 Foo クラスの func メソッドを指す。</p>
<p>
そして、次のコマンドを実行することで、
@mini.Foo.func の定義位置がリストされる。</p>
<div class="src src-txt">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-txt" data-lang="txt"><span class="line"><span class="cl">$ lnstags inq def @mini.Foo.func
</span></span><span class="line"><span class="cl">@mini.Foo.func      2 mini.lns            pub fn func() {</span></span></code></pre></div>
</div>
<p>
このコマンド <code class="verbatim">lnstags inq def</code> の <strong>def</strong> は、 <strong>定義場所</strong> の問い合わせを指定する。</p>
</div>
</div>
