hugo/content/LuneScript/lnstags.org
*** inq-at

問い合わせしたいシンボルの完全限定名が判っている場合は inq コマンドが利用できるが、
完全限定名を調べるのが困難だったり面倒だったりする。

そこで、ソースの所定位置のシンボルについて問い合わせを行なうのが *inq-at* である。

以下のソースがある時に、
10 行目の 5 列目にある foo.func() の定義場所を問合せる場合、

#+BEGIN_SRC lns
// @lnsFront: ok
class Foo {
   pub fn func() {
   }
}
class Bar {
   pub fn func() {
   }
}
let foo = new Foo();
foo.func();
let bar = new Bar();
bar.func();
#+END_SRC

次のコマンドを実行する。

#+BEGIN_SRC txt
$ lnstags inq-at def mini.lns 10 5
@mini.Foo.func      2 mini.lns            pub fn func() {
#+END_SRC

これにより、指定した場所にあるシンボルについての問い合わせが行なわれる。

上記の場合、 mini.lns 10 5 にある =foo.func= の完全限定名が、
@mini.Foo.func であることを認識し、
それについての *def* 問い合わせを行なっている。

なお、inq-at を利用する場合、
*指定の lns ファイルがエラー無くビルドできなければならない。*

また、指定の lns ファイルの AST を解析するため、時間がかかる。


*** suffix

inq-at は lns ファイルの位置を指定して完全限定名を取得するが、
suffix はシンボル名の後方一致で完全限定名のリストを取得する。

例えば func に後方一致する完全限定名のリストを表示するには以下を実行する。

#+BEGIN_SRC txt
$ lnstags suffix func
@mini.Foo.func
@mini.Bar.func
#+END_SRC

* emacs から利用する場合

lisp/lnstags-conf.el をロードする。

キーバインドは次の通り。

| キー | 操作                                           |
|------+------------------------------------------------|
| M-t  | カーソル位置のシンボルの *定義位置* にジャンプ |
| M-r  | カーソル位置のシンボルの *参照位置* にジャンプ |
| M-s  | カーソル位置のシンボルの *設定位置* にジャンプ |
| M-m  | タグジャンプの履歴                             |
| C-t  | ジャンプ元に戻る                               |


M-t, M-r, M-s については、完全限定名を得るために suffix 問い合わせを実行し、
シンボルに一致する完全限定名をリストし、
選択された完全限定名についての inq 問い合わせを行なう。

なお、M-t, M-r, M-s にプレフィックス C-u を付けることで、
カーソル位置の inq-at 問い合わせを行なう。

