hugo/public/lunescript/lnstags/index.html
<div id="outline-container-headline-13" class="outline-4">
<h4 id="headline-13">
問い合わせモード
</h4>
<div id="outline-text-headline-13" class="outline-text-4">
<p>
問い合わせの種類は次がある。</p>
<table>
<thead>
<tr>
<th>オプション</th>
<th>動作</th>
</tr>
</thead>
<tbody>
<tr>
<td>def</td>
<td>定義位置</td>
</tr>
<tr>
<td>ref</td>
<td>参照位置</td>
</tr>
<tr>
<td>set</td>
<td>設定位置</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-headline-14" class="outline-4">
<h4 id="headline-14">
inq-at
</h4>
<div id="outline-text-headline-14" class="outline-text-4">
<p>
問い合わせしたいシンボルの完全限定名が判っている場合は inq コマンドが利用できるが、
完全限定名を調べるのが困難だったり面倒だったりする。</p>
<p>
そこで、ソースの所定位置のシンボルについて問い合わせを行なうのが <strong>inq-at</strong> である。</p>
<p>
以下のソースがある時に、
10 行目の 5 列目にある <code class="verbatim">foo.func()</code> の定義場所を問合せる場合、</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
class Foo {
   pub fn func() {
   }
}
class Bar {
   pub fn func() {
   }
}
let foo = new Foo();
foo.func();
let bar = new Bar();
bar.func();</code></pre>
</div>
<p>
次のコマンドを実行する。</p>
<div class="src src-txt">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-txt" data-lang="txt"><span class="line"><span class="cl">$ lnstags inq-at def mini.lns 10 5
</span></span><span class="line"><span class="cl">@mini.Foo.func      2 mini.lns            pub fn func() {</span></span></code></pre></div>
</div>
<p>
これにより、指定した場所にあるシンボルについての問い合わせが行なわれる。</p>
<p>
上記の場合、 mini.lns 10 5 にある <code class="verbatim">foo.func</code> の完全限定名が、
@mini.Foo.func であることを認識し、
それについての <strong>def</strong> 問い合わせを行なっている。</p>
<p>
なお、inq-at を利用する場合、
<strong>指定の lns ファイルがエラー無くビルドできなければならない。</strong></p>
<p>
また、指定の lns ファイルの AST を解析するため、時間がかかる。</p>
</div>
</div>
<div id="outline-container-headline-15" class="outline-4">
<h4 id="headline-15">
suffix
</h4>
<div id="outline-text-headline-15" class="outline-text-4">
<p>
inq-at は lns ファイルの位置を指定して完全限定名を取得するが、
suffix はシンボル名の後方一致で完全限定名のリストを取得する。</p>
<p>
例えば func に後方一致する完全限定名のリストを表示するには以下を実行する。</p>
<div class="src src-txt">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-txt" data-lang="txt"><span class="line"><span class="cl">$ lnstags suffix func
</span></span><span class="line"><span class="cl">@mini.Foo.func
</span></span><span class="line"><span class="cl">@mini.Bar.func</span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-16" class="outline-2">
<h2 id="headline-16">
emacs から利用する場合
</h2>
<div id="outline-text-headline-16" class="outline-text-2">
<p>
lisp/lnstags-conf.el をロードする。</p>
<p>
キーバインドは次の通り。</p>
<table>
<thead>
<tr>
<th>キー</th>
<th>操作</th>
</tr>
</thead>
<tbody>
<tr>
<td>M-t</td>
<td>カーソル位置のシンボルの <strong>定義位置</strong> にジャンプ</td>
</tr>
<tr>
<td>M-r</td>
<td>カーソル位置のシンボルの <strong>参照位置</strong> にジャンプ</td>
</tr>
<tr>
<td>M-s</td>
<td>カーソル位置のシンボルの <strong>設定位置</strong> にジャンプ</td>
</tr>
<tr>
<td>M-m</td>
<td>タグジャンプの履歴</td>
</tr>
<tr>
<td>C-t</td>
<td>ジャンプ元に戻る</td>
</tr>
</tbody>
</table>
<p>
M-t, M-r, M-s については、完全限定名を得るために suffix 問い合わせを実行し、
シンボルに一致する完全限定名をリストし、
選択された完全限定名についての inq 問い合わせを行なう。</p>
<p>
なお、M-t, M-r, M-s にプレフィックス C-u を付けることで、
カーソル位置の inq-at 問い合わせを行なう。</p>
</div>
</div>
